[
  {
    "plantId": 1,
    "slogan": "Breathe Easy, Live Green.",
    "plantName": "Snake Plant",
    "category": "Air Purifier",
    "price": "৳ 1800",
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Easy",
    "description": "The Snake Plant, also known as Sansevieria or Mother-in-Law’s Tongue, is one of the most resilient and visually striking indoor plants. Its tall, sword-shaped leaves grow upright, giving it a bold, architectural look that suits modern interiors perfectly. These leaves often feature beautiful variegation, with patterns of deep green, light green, or yellow edges depending on the variety. The Snake Plant is famous for being nearly impossible to kill, making it an excellent choice for beginners or busy plant owners. It thrives in low, medium, or bright light, adapting easily to any corner of the home. This plant also tolerates neglect and requires very minimal watering, thanks to its succulent-like ability to store moisture. Overwatering is the only real danger, so it’s best to allow the soil to dry completely between waterings. One of its greatest benefits is its strong air-purifying ability, filtering toxins like formaldehyde, toluene, and xylene from indoor spaces. At night, the Snake Plant releases oxygen, making it a great choice for bedrooms. Its upright growth habit allows it to fit well in narrow spaces, hallways, or small apartments. The plant’s clean, sculptural appearance adds elegance and structure to any room. It can also adapt to dry air, fluctuating temperatures, and low humidity without stress. Snake Plants come in many varieties, from tall and dramatic to short and compact, offering endless design possibilities. They are slow growers but incredibly long-lived, often thriving for many years. This plant rarely suffers from pests, adding to its reputation as a low-maintenance houseplant. When placed in bright indirect light, it may occasionally produce small, fragrant white flowers as a bonus. The Snake Plant’s natural toughness makes it ideal for offices, homes, or spaces with inconsistent care. Whether used as a statement floor plant or a small tabletop accent, it brings a modern, stylish touch to interiors. Overall, the Snake Plant is a durable, attractive, and air-purifying plant that effortlessly enhances both the look and feel of any indoor environment.",
    "image": "https://i.ibb.co.com/60WDjDQc/noyo-creatif-45-RNRu-AZVMw-unsplash.jpg",
    "providerName": "UrbanGreen Studio",
    "watering": "Water your snake plant every 2–3 weeks, depending on the season and humidity. Ensure the soil dries completely between waterings, as overwatering can cause root rot. During the winter months, reduce watering even further since the plant grows more slowly. Use a pot with proper drainage to prevent water from sitting at the bottom. Always check the soil moisture by sticking your finger about an inch deep before watering.",
    "sunlight": "Snake plants thrive in bright, indirect light but are also very tolerant of low-light conditions. They can be placed in rooms with filtered sunlight or away from windows. Avoid direct, harsh sunlight, which can scorch the leaves. These adaptable plants are excellent for offices or rooms with minimal natural light. They can also survive under fluorescent lighting for extended periods.",
    "fertilizing": "Feed your snake plant with a balanced houseplant fertilizer once a month during spring and summer. Avoid fertilizing in fall and winter when growth slows down. Dilute the fertilizer to half the recommended strength to prevent overfeeding. A liquid or water-soluble fertilizer works best for even nutrient absorption. Fertilizing helps maintain strong, healthy leaves and encourages new growth."
  },
  {
    "plantId": 2,
    "slogan": "Purity in Every Leaf.",
    "plantName": "Peace Lily",
    "category": "Flowering",
    "price": "৳ 2200",
    "rating": 4.6,
    "availableStock": 8,
    "careLevel": "Medium",
    "description": "The Peace Lily, scientifically known as Spathiphyllum, is a beloved indoor plant admired for its serene beauty and elegant presence. It features glossy, deep-green leaves that grow in graceful, arching formations, creating a lush and calming display. One of its most iconic features is the striking white bloom, often mistaken for a flower, which is actually a specialized leaf called a spathe surrounding a spadix. These blooms symbolize peace and purity, making the plant a meaningful addition to homes, offices, and meditation spaces. The Peace Lily thrives in low to medium light, making it perfect for indoor environments with limited natural sun. It is also known for its excellent air-purifying abilities, removing toxins like benzene, formaldehyde, and mold spores from the air. This plant prefers consistently moist soil and will dramatically droop when thirsty, giving a clear sign that it needs water. Once hydrated, it usually perks back up quickly, making it easy for beginners to care for. Its ability to adapt to different humidity and temperature levels makes it a very forgiving houseplant. The Peace Lily’s gentle aesthetic creates a soothing atmosphere, enhancing relaxation in bedrooms and living rooms. Many people appreciate its capacity to bloom several times throughout the year when cared for properly. Its lush leaves also add a touch of tropical elegance to modern and traditional interiors alike. This plant grows in a compact yet full manner, making it suitable for both small and large spaces. It is often chosen as a gift plant due to its symbolic meaning and low-maintenance nature. The Peace Lily helps create a cleaner, fresher indoor environment, promoting overall well-being. Its simple white spathes stand out beautifully against the dark foliage, creating a timeless contrast. With minimal care, it can flourish for many years and become a cherished part of any plant collection. It is also one of the most rewarding plants for beginners because it visibly responds to good care. Whether placed on a desk, shelf, or floor, it adds instant softness and elegance to any room. Overall, the Peace Lily is a graceful, purifying, and easy-to-care-for plant that brings both beauty and a sense of tranquility to indoor spaces.",
    "image": "https://i.ibb.co.com/bMcFMtRC/premium-photo-1676117273320-0b0cc05cbfc3.jpg",
    "providerName": "Bloom & Root",
    "watering": "Water your peace lily about once a week, keeping the soil consistently moist but not soggy. Allow the top inch of soil to dry out slightly between waterings to prevent root rot. During warmer months, you may need to water more frequently. Reduce watering in winter when growth slows down. Mist the leaves occasionally to increase humidity and keep them vibrant.",
    "sunlight": "Peace lilies prefer bright, indirect light but can tolerate low-light conditions. Avoid direct sunlight, which can scorch the leaves. They do well in shaded corners or near north or east-facing windows. Insufficient light may reduce flowering, but the plant will still survive. Fluorescent lighting indoors can also support moderate growth.",
    "fertilizing": "Feed your peace lily with a balanced liquid houseplant fertilizer every 6–8 weeks during spring and summer. Avoid fertilizing in fall and winter when growth slows down. Dilute the fertilizer to half the recommended strength to prevent leaf burn. Fertilizing encourages healthy foliage and promotes blooming. Over-fertilizing can cause brown leaf tips, so moderation is key."
  },
  {
    "plantId": 3,
    "slogan": "Graceful Green for Any Space.",
    "plantName": "Chinese Evergreen",
    "category": "Decorative",
    "price": "৳ 2000",
    "rating": 4.7,
    "availableStock": 9,
    "careLevel": "Medium",
    "description": "The Chinese Evergreen, scientifically known as Aglaonema, is a stylish and resilient houseplant treasured for its lush, patterned foliage. Its leaves come in a stunning variety of colors, including shades of green, silver, cream, red, and pink, depending on the variety. These leaves are broad, glossy, and often beautifully variegated, making the plant an eye-catching decorative piece for any room. One of the most appealing qualities of the Chinese Evergreen is its incredible tolerance for low-light conditions. It can thrive in corners, offices, or spaces without direct sunlight, making it ideal for indoor environments. The plant grows slowly but steadily, maintaining a compact, bushy shape that fits perfectly on desks, shelves, or tabletops. Its easy care requirements make it suitable even for beginners or busy plant owners. The Chinese Evergreen prefers moderate watering and can handle occasional neglect without suffering. It is also well-known for its ability to purify indoor air by filtering out toxins such as benzene and formaldehyde. With proper care, it produces new leaves regularly, adding fresh bursts of color to your space. The plant’s graceful growth pattern creates a calm, balanced look that enhances the atmosphere of any room. It also tolerates a wide range of temperatures and humidity levels, making it a versatile option for homes and workplaces. Many plant lovers admire its durability, as it resists pests and diseases better than many other houseplants. Its peaceful appearance makes it a popular choice for creating relaxing environments. Varieties with red or pink tones add unique vibrancy and personality to plant collections. The Chinese Evergreen is also thought to bring good energy and luck according to traditional beliefs. Whether used as a statement plant or a subtle foliage accent, it always adds beauty and elegance to the surroundings. Its long-lasting foliage ensures year-round greenery with minimal effort. Overall, the Chinese Evergreen is a dependable, decorative plant perfect for both new and experienced plant owners.",
    "image": "https://i.ibb.co.com/KxRCzJWG/h4zfnbeg7qne1.jpg",
    "providerName": "NatureNook",
    "watering": "Water your Chinese Evergreen every 1–2 weeks, allowing the top 1–2 inches of soil to dry out between waterings. Reduce watering in the winter when growth slows down. Overwatering can lead to root rot, so always check the soil before adding more water. Use a pot with proper drainage to avoid standing water. Mist the leaves occasionally to maintain humidity and leaf health.",
    "sunlight": "Chinese Evergreens thrive in low to medium indirect light but can tolerate low-light conditions. Avoid direct sunlight, which can scorch the leaves and fade their patterns. They are ideal for offices or indoor spaces with filtered light. Too little light may slow growth but won’t kill the plant. Bright indirect light encourages vibrant leaf colors and patterns.",
    "fertilizing": "Feed your Chinese Evergreen with a balanced, water-soluble houseplant fertilizer every 4–6 weeks during spring and summer. Avoid fertilizing in fall and winter when growth slows down. Dilute the fertilizer to half the recommended strength to prevent leaf burn. Fertilizing promotes lush, healthy foliage and supports new growth. Over-fertilization can cause yellowing leaf edges, so moderation is important."
  },
  {
    "plantId": 4,
    "slogan": "Air Cleaner, Mood Booster.",
    "plantName": "Spider Plant",
    "category": "Hanging",
    "price": "৳ 1600",
    "rating": 4.7,
    "availableStock": 12,
    "careLevel": "Easy",
    "description": "The Spider Plant, scientifically known as Chlorophytum comosum, is one of the most beloved and easy-care houseplants. It is instantly recognizable for its long, arching leaves that are typically striped with shades of green and creamy white. These elegant leaves spill gracefully over the edges of pots, giving the plant a lively, fountain-like appearance. One of its most charming features is the production of tiny “baby” plants, also called spiderettes, that hang from long stems like little green ornaments. These baby offshoots can be easily propagated, making the Spider Plant a favorite for sharing with friends and expanding plant collections. It thrives in bright, indirect light but is adaptable enough to grow well in low-light environments too. Because of its resilience, it is often recommended for beginners or anyone who wants a low-maintenance plant. The Spider Plant prefers slightly moist soil, but it is forgiving if you occasionally forget to water it. It is also known for its strong air-purifying abilities, helping remove pollutants such as formaldehyde and xylene from indoor spaces. Its ability to tolerate different temperatures and humidity levels makes it a versatile choice for homes and offices. The plant rarely suffers from pests or diseases, adding to its reputation as one of the easiest plants to care for. When grown in hanging planters, its cascading leaves and spiderettes create a beautiful, flowing display. The Spider Plant can also adapt to regular pots and still maintain its signature arching shape. With proper care, it grows quickly and rewards owners with frequent new leaves. Its lively, fresh appearance brings a sense of energy and brightness to any room. Many people also appreciate its pet-friendly nature, as it is non-toxic to cats and dogs. As one of the most popular indoor plants worldwide, the Spider Plant continues to be loved for its beauty, durability, and effortless charm. It is the perfect combination of decorative appeal and easy maintenance, making it a timeless addition to any indoor plant collection.",
    "image": "https://i.ibb.co.com/dJf5MD8R/rach-teo-m-Eu9-Og-H3r1-U-unsplash.jpg",
    "providerName": "Leaf & Loom",
    "watering": "Water your spider plant moderately, about once a week, keeping the soil slightly moist but not soggy. Allow the top inch of soil to dry out between waterings to prevent root rot. During winter, reduce watering as the plant’s growth slows. Ensure the pot has good drainage to avoid standing water. Check soil moisture regularly, especially in dry indoor environments.",
    "sunlight": "Spider plants thrive in bright, indirect light but can tolerate low-light conditions. Avoid direct sunlight, which may scorch their leaves. They grow well near east or north-facing windows or in rooms with filtered sunlight. In low light, growth may slow but the plant will survive. Providing bright, indirect light encourages lush green leaves and healthy offshoots.",
    "fertilizing": "Feed your spider plant with a balanced liquid houseplant fertilizer every 4–6 weeks during spring and summer. Avoid fertilizing in fall and winter when the plant is not actively growing. Dilute the fertilizer to half strength to prevent leaf tip burn. Fertilizing supports vibrant leaves and healthy “spiderettes.” Over-fertilization can lead to brown leaf tips, so moderation is important."
  },
  {
    "plantId": 5,
    "slogan": "Go Wild, Stay Chic.",
    "plantName": "Monstera Deliciosa",
    "category": "Tropical",
    "price": "৳ 3000",
    "rating": 4.9,
    "availableStock": 6,
    "careLevel": "Medium",
    "description": "Monstera Deliciosa, often called the “Swiss Cheese Plant,” is one of the most iconic and recognizable indoor plants in the world. Its large, glossy green leaves develop natural holes and splits known as fenestrations, giving the plant a dramatic and tropical appearance. These striking patterns allow the plant to capture sunlight more efficiently in its native rainforest habitat. Monstera Deliciosa can grow impressively tall indoors, often reaching several feet when provided with proper support. It thrives best in bright, indirect light, which encourages larger leaves and more fenestrations. The plant prefers well-draining soil and slightly moist conditions, making moderate watering ideal. Because of its bold and architectural shape, Monstera instantly becomes the centerpiece of any room. It also helps purify the air, improving indoor air quality over time. The plant enjoys higher humidity, but it can still adapt to typical household environments. As it grows, Monstera develops aerial roots that help support the plant and give it a natural, wild look. Many plant enthusiasts like to train their Monstera on a moss pole or trellis to encourage vertical growth. It is relatively low-maintenance, making it a good option for both beginners and experienced plant lovers. Occasional cleaning of its large leaves helps it absorb more light and maintain its glossy appearance. When cared for properly, Monstera Deliciosa can produce new leaves frequently, each one more beautiful than the last. It is also easy to propagate by stem cuttings, allowing you to expand your plant collection or gift new plants to friends. In the right environment, the plant can live for many years and grow into a stunning, mature specimen. Monstera Deliciosa brings a lush, tropical feel to indoor spaces, making homes feel more serene and vibrant. Its timeless beauty and impressive growth make it a beloved favorite among houseplant enthusiasts worldwide.",
    "image": "https://i.ibb.co.com/Qj1Ln24S/premium-photo-1669148911895-a95de51d09ca.jpg",
    "providerName": "The Green Corner",
    "watering": "Water every 1–2 weeks, letting the top 2 inches of soil dry out between waterings. Reduce watering in winter when growth slows. Overwatering can cause root rot, so ensure proper drainage. Check soil moisture before watering. Mist leaves occasionally to increase humidity.",
    "sunlight": "Prefers bright, indirect light; avoid direct sunlight that can burn leaves. Can tolerate moderate light, though growth slows. Ideal for east or north-facing windows. Too little light may reduce leaf splits. Bright light encourages larger, healthier leaves.",
    "fertilizing": "Feed with a balanced liquid fertilizer every 4–6 weeks during spring and summer. Avoid fertilizing in winter. Dilute fertilizer to half strength to prevent leaf burn. Fertilizing promotes strong growth and large leaves. Over-fertilization can cause yellow leaf tips."
  },
  {
    "plantId": 6,
    "slogan": "Trail Your Way to Green Happiness.",
    "plantName": "Pothos Golden",
    "category": "Vine",
    "price": "৳ 1400",
    "rating": 5,
    "availableStock": 20,
    "careLevel": "Easy",
    "description": "Golden Pothos, also known as Epipremnum aureum, is one of the most popular and beginner-friendly houseplants in the world. Its heart-shaped leaves are splashed with beautiful golden-yellow variegation, giving the plant a vibrant and lively appearance. The trailing vines can grow impressively long, making it perfect for hanging baskets or high shelves. Golden Pothos is extremely adaptable and can thrive in a variety of light conditions, from bright indirect light to low-light corners. This versatility makes it ideal for bedrooms, living rooms, offices, or even bathrooms. The plant is well-known for being forgiving, often surviving occasional neglect or irregular watering. It prefers its soil to dry out between waterings, which helps prevent root rot. Golden Pothos is also valued for its air-purifying qualities, as it helps remove toxins like formaldehyde and benzene from the air. Its rapid growth rate makes it exciting for plant lovers who enjoy watching visible progress. The vines can be trained to climb up trellises, poles, or walls, adding a decorative touch to any space. When placed in the right environment, the variegation on the leaves becomes more pronounced and vibrant. Golden Pothos is also one of the easiest plants to propagate, requiring only a simple cutting placed in water or soil. This makes it a great plant to share with friends or use to create new pots around your home. The plant enjoys moderate humidity but can still do well in normal indoor conditions. Its low-maintenance nature makes it perfect for busy people, beginners, or anyone wanting a plant that thrives effortlessly. Golden Pothos rarely suffers from pests when properly cared for. With a little attention, the plant can transform dull corners into lush, green displays. It continues to be a timeless choice for indoor gardeners because of its beauty, durability, and ease of care. Whether cascading from a shelf or climbing upward, Golden Pothos adds warmth and life to any room.",
    "image": "https://i.ibb.co.com/VYXYTddL/how-to-get-my-pothos-to-get-like-this-golden-v0-sjhbvz8mxbae1.jpg",
    "providerName": "UrbanGreen Studio",
    "watering": "Water every 1–2 weeks, allowing the soil to dry between waterings. Reduce frequency in winter. Overwatering can cause root rot. Use a well-draining pot. Check soil moisture to ensure it’s not soggy.",
    "sunlight": "Thrives in bright, indirect light but tolerates low light. Avoid direct sunlight, which can scorch leaves. Ideal for indoor rooms with filtered light. Low light slows growth and fades variegation. Bright light enhances leaf patterns.",
    "fertilizing": "Feed monthly during spring and summer with a balanced liquid fertilizer. Skip fertilizing in fall/winter. Dilute fertilizer to avoid overfeeding. Fertilizing encourages healthy leaves and trailing growth. Over-fertilization may cause leaf tip burn."
  },
  {
    "plantId": 7,
    "slogan": "Healing Nature at Your Fingertips.",
    "plantName": "Aloe Vera",
    "category": "Succulent",
    "price": "৳ 1200",
    "rating": 4.9,
    "availableStock": 18,
    "careLevel": "Easy",
    "description": "Aloe vera is a popular succulent plant known for its thick, fleshy leaves filled with a soothing gel. The plant has a striking rosette shape that makes it visually appealing in any indoor space. Its leaves are usually green with a slightly glossy texture and sometimes have small white speckles. Aloe vera is widely loved for its low-maintenance nature, thriving even when it is occasionally neglected. It prefers bright, indirect sunlight but can also tolerate a bit of direct sun. The plant stores water in its leaves, allowing it to survive long periods without watering. Overwatering can harm it, so aloe vera is best kept in well-draining soil. Many people grow it not just for decoration but also for its medicinal benefits. The gel inside its leaves is commonly used to soothe burns, cuts, and irritated skin. Aloe gel is also found in many skincare and cosmetic products. The plant naturally purifies the air, making it a healthy addition to homes and workplaces. Aloe vera can grow quite fast when properly cared for. It often produces “pups,” or baby plants, around its base that can be replanted to grow new aloes. The plant enjoys warm temperatures and does not tolerate frost well. Its upright, structured growth makes it a great fit for minimalist or modern home décor. Aloe vera is also commonly associated with healing and wellness due to its beneficial properties. The plant has been used for centuries in traditional medicine across various cultures. With sunlight, occasional watering, and good soil, it continues to thrive effortlessly. Whether placed on a windowsill, a desk, or a balcony, aloe vera adds both beauty and practicality to the environment.",
    "image": "https://i.ibb.co.com/TBDf67yP/feey-x-QKp9q-CPAH0-unsplash.jpg",
    "providerName": "Bloom & Root",
    "watering": "Water deeply but infrequently, about every 3 weeks, allowing soil to dry completely between waterings. Reduce watering in winter. Avoid letting water sit in the pot. Overwatering can rot the roots. Check soil moisture before adding water.",
    "sunlight": "Prefers bright, indirect light or some direct sunlight. Avoid prolonged harsh sunlight to prevent leaf burn. Can tolerate indoor sunny windows. Moderate light supports strong, healthy leaves. Too little light may make leaves thin and weak.",
    "fertilizing": "Feed with a succulent-specific or balanced fertilizer every 6–8 weeks in spring and summer. Skip fertilizing in winter. Dilute fertilizer to half strength to prevent leaf burn. Fertilizing encourages robust leaf growth. Overfeeding may cause brown leaf tips."
  },
  {
    "plantId": 8,
    "slogan": "Zero Fuss, Full Beauty.",
    "plantName": "ZZ Plant",
    "category": "Low Light",
    "price": "৳ 2500",
    "rating": 4.8,
    "availableStock": 15,
    "careLevel": "Easy",
    "description": "The ZZ Plant, scientifically known as Zamioculcas zamiifolia, is one of the most resilient and low-maintenance indoor plants you can own. Its glossy, dark green leaves grow in a sleek, symmetrical pattern that makes the plant look almost sculptural. Many plant lovers appreciate how effortlessly stylish it appears in any room. The ZZ Plant is famous for surviving in environments where most other plants struggle. It can tolerate very low light, making it perfect for offices, bedrooms, and corners without windows. Even if you forget to water it for weeks, the plant continues to look fresh because it stores moisture in its thick rhizomes. These potato-like roots allow it to endure long periods of drought. The leaves have a natural shine that gives them a polished, almost artificial look. When placed in brighter light, the plant may grow faster, producing new shoots that rise gracefully from the soil. Its upright, clean-lined appearance fits beautifully with modern and minimalist décor styles. The ZZ Plant is also valued for its air-purifying qualities, helping remove pollutants and improving indoor air quality. It rarely suffers from pests, making it ideal for beginners. Caring for it requires little more than occasional watering and a bit of dusting on the leaves. Over time, the plant becomes fuller and more impressive, developing strong stems that arch slightly outward. Native to the dry regions of East Africa, the ZZ Plant has adapted perfectly to indoor living across the world. Its durability makes it a long-lasting companion for busy individuals, students, or anyone new to plant care. Despite its tough nature, it still brings a sense of calm and natural beauty into any space. Many people choose it because it brings life to a room without demanding constant attention. As a decorative plant, it blends well with any interior theme—from rustic to contemporary. A mature ZZ Plant becomes a graceful, eye-catching piece of natural art that enhances the atmosphere wherever it is placed.",
    "image": "https://i.ibb.co.com/DHWLqbyp/kadarius-seegars-E2al-Kui-CUKY-unsplash.jpg",
    "providerName": "NatureNook",
    "watering": "Water every 2–3 weeks, letting the soil dry completely between waterings. Reduce watering in winter. Overwatering can cause root rot. Use a well-draining potting mix. Check soil before watering to avoid soggy conditions.",
    "sunlight": "Tolerates low light but grows faster in bright, indirect light. Avoid direct sunlight, which can scorch leaves. Suitable for offices and low-light indoor spaces. Too little light slows growth but won’t kill it. Bright indirect light promotes glossy, healthy leaves.",
    "fertilizing": "Feed monthly in spring and summer with a balanced liquid fertilizer. Skip fertilizing in fall and winter. Dilute fertilizer to prevent overfeeding. Fertilizing encourages new growth and maintains leaf shine. Over-fertilization can yellow the leaves."
  },
  {
    "plantId": 9,
    "slogan": "Strength in Green.",
    "plantName": "Rubber Plant",
    "category": "Foliage",
    "price": "৳ 2800",
    "rating": 4.7,
    "availableStock": 7,
    "careLevel": "Medium",
    "description": "The Rubber Plant, also known as Ficus elastica, is a striking indoor plant admired for its glossy, oversized leaves and elegant upright growth. Its deep green foliage instantly adds a touch of sophistication to any living space. Many people love keeping it indoors because it grows tall and dramatic without demanding too much attention. With the right care, a Rubber Plant can become a stunning statement piece that reaches impressive heights. Its leaves have a thick, almost waxy texture that helps it retain moisture and remain vibrant throughout the year. In bright, indirect light, the plant thrives and develops richer, more vivid colors. Even in low-light rooms, it manages to survive, making it a great choice for beginners. Rubber Plants are also known for their air-purifying abilities, helping reduce toxins and improve indoor air quality. They grow steadily, producing new leaves one at a time, each one unfurling like a beautiful scroll. These plants prefer slightly dry soil and don’t need frequent watering. Overwatering is one of the only things that can harm them. With occasional wiping of the leaves, they stay shiny and healthy. Rubber Plants can be pruned to maintain the perfect height and shape for your room. The plant originates from Southeast Asia, where it grows as a large tropical tree. Indoors, however, it adapts well to pots and apartments of all sizes. Its resilience makes it a long-lasting companion for plant lovers. Many people choose Rubber Plants because they bring a bold yet minimalistic look to modern interiors. Whether placed in a corner, beside a window, or on a decorative stand, it naturally draws attention. Over time, its thick stem becomes stronger and more tree-like, giving the plant a mature and sculptural appearance. A Rubber Plant is not just décor—it’s a living piece of nature that brings calmness, elegance, and fresh energy into any home.",
    "image": "https://i.ibb.co.com/CsYcS5K7/denley-photography-GNd-Lc38z-Nj-U-unsplash.jpg",
    "providerName": "The Green Corner",
    "watering": "Water every 1–2 weeks, allowing the top inch of soil to dry between waterings. Reduce watering in winter. Overwatering can lead to root rot. Ensure the pot has proper drainage. Check soil moisture before watering.",
    "sunlight": "Prefers bright, indirect light but tolerates moderate light. Avoid direct sunlight that may scorch leaves. Can grow near windows with filtered sunlight. Low light slows growth and dulls leaf color. Bright light encourages vibrant, glossy leaves.",
    "fertilizing": "Feed monthly during spring and summer with a balanced liquid fertilizer. Skip fertilizing in fall/winter. Dilute fertilizer to half strength to avoid leaf burn. Fertilizing promotes strong, healthy leaves. Over-fertilization can cause yellowing leaf edges."
  }
]